---
type: IPerformanceAdviserRule
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# IPerformanceAdviserRule

`Autodesk.Revit.DB.IPerformanceAdviserRule` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | ExecuteElementCheck | 2012 | `void ExecuteElementCheck ( Document document , Element element )` |
| Method | FinalizeCheck | 2012 | `void FinalizeCheck ( Document document )` |
| Method | GetDescription | 2012 | `string GetDescription ()` |
| Method | GetElementFilter | 2012 | `ElementFilter GetElementFilter ( Document document )` |
| Method | GetName | 2012 | `string GetName ()` |
| Method | InitCheck | 2012 | `void InitCheck ( Document document )` |
| Method | WillCheckElements | 2012 | `bool WillCheckElements ()` |